In [1]:
#SERIES

In [2]:
import numpy as np
import pandas as pd

In [3]:
arr = ['a' , 'b' , 'c']
my_data = [10,20,30]
d={'a':10 , 'b':20 , 'c':30}

In [4]:
pd.Series(data=my_data , index=arr)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series([1,2,3,4,5],['A','B','C','D','E'])

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
from numpy.random import randn
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [13]:
df.drop('new' , axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [15]:
df.drop('A' , axis=1 , inplace=True)

In [16]:
df

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [17]:
#Rows Selection

df.iloc[1:2]

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001 -1.278046

In [18]:
df.loc['B']

W      0.651118
X     -0.319318
Y     -0.848077
Z      0.605965
new    0.331800
Name: B, dtype: float64

In [19]:
df.loc['C','X']

0.7401220570561068

In [20]:
df.loc[['B' , 'C'] , ['X','Y']]

          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813

In [21]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
#conditional selection 
booldf=df < 0

In [23]:
df[booldf]

          W        X         Y         Z
A       NaN      NaN -1.706086 -1.159119
B -0.134841      NaN       NaN       NaN
C       NaN      NaN       NaN       NaN
D -0.497104 -0.75407 -0.943406       NaN
E -0.116773      NaN       NaN       NaN

In [24]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [25]:
df[df['W'] > 0][['Y' , 'Z']]

          Y         Z
A -1.706086 -1.159119
C  0.638787  0.329646

In [26]:
booler = df['W'] > 0
resultdf =df[booler]
mycols = ['X' , 'Y']
resultdf[mycols]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [27]:
df[(df['W']>0) & (df['Y'] < 1)]['Z']

A   -1.159119
C    0.329646
Name: Z, dtype: float64

In [28]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [29]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
newind = 'CO AC NY WD JD'.split()

In [31]:
df['states'] =  newind
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119     CO
B -0.134841  0.390528  0.166905  0.184502     AC
C  0.807706  0.072960  0.638787  0.329646     NY
D -0.497104 -0.754070 -0.943406  0.484752     WD
E -0.116773  1.901755  0.238127  1.996652     JD

In [32]:
df.set_index('states')

               W         X         Y         Z
states
CO      0.302665  1.693723 -1.706086 -1.159119
AC     -0.134841  0.390528  0.166905  0.184502
NY      0.807706  0.072960  0.638787  0.329646
WD     -0.497104 -0.754070 -0.943406  0.484752
JD     -0.116773  1.901755  0.238127  1.996652

In [33]:
import numpy as np
import pandas  as pd
from numpy.random import randn

In [34]:
#multi level index
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [35]:
df = pd.DataFrame(randn(6,2) , hier_index , ['A','B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [36]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [37]:
df.loc['G2'].loc[2]

A    2.154846
B   -0.610259
Name: 2, dtype: float64

In [38]:
df.index.names = ['Groups' , 'Num']

In [39]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [40]:
df.loc['G1'].loc[3]['A']

1.025984152081572

In [41]:
df.xs('G1')
#xs-cross section

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [42]:
df.xs(1 , level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

In [43]:
#missing data 
import numpy as np
import pandas as pd

In [44]:
d = {'A':[1 ,2 , np.nan] , 'B':[2 , np.nan , np.nan ] , 'C':[1,2,3] }

In [45]:
df = pd.DataFrame(d)

In [46]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df.dropna()

     A    B  C
0  1.0  2.0  1

In [48]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [49]:
df.dropna(thresh=2)

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2

In [50]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [51]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           2  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [52]:
df['A'].fillna(value=df['A'].mean() , inplace=True)
df['B'].fillna(value=df['B'].mean() , inplace=True)
df

     A    B  C
0  1.0  2.0  1
1  2.0  2.0  2
2  1.5  2.0  3

In [53]:
#groupby operations
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [54]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [55]:
bycomp=df.groupby('Company')

In [56]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [57]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [58]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
bycomp.count().loc['FB']

Person    2
Sales     2
Name: FB, dtype: int64

In [60]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
#operations
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [62]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [63]:
df['col2'].nunique()

3

In [64]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [65]:
def times2(x):
    return x*2

In [66]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [67]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [68]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [69]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [70]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)